def print_hello():
    for i in range(3):
        print("hello")


print_hello()

def aca():
    print("done")

def cs():
    return 3

print(aca())           # این تابع چیزی رو برنمیگردونه و صرفا فقط یکچیزی رو انجام میده
print(cs())

def test(*args):
    print(args)

test(1,2,3,4,5,6)       #که از نوع تاپله چون نمیدونم قراره چندتا ایتم متغییر بهش بدم از args استفاده میکنم

def test2(**kwargs):
    print(kwargs)

test2(name = 'ali' , lname = 'bigdeli')

def delta(a,b,c):
    return (b**2) - (4*a*c)

print(delta(5,1,3))


"""
مدل‌های یک تابع از لحاظ مقدار بازگشتی
یک تابع تعریف شده می‌تواند عملکردهایی را به دنبال داشته باشد که در نهایت به نتایج بازگشتی ختم شوند و یا اینکه فقط عملیاتی رو صرفاً انجام داده و خارج شوند که در این صورت از دستور return برای بازگشت مقادیر نهایی در تابع استفاده می‌شود که تعیین‌کننده مقدار بازگشتی توسط کاربر خواهد بود. اما در شرایطی که در تابع مدنظر از این دستور استفاده نشود و خروجی را بازنگرداند مقدار بازگشتی تابع برابر با None خواهد بود.

 

برای اطلاعات بیشتر می‌توانید به دوره‌های موجود در سایت مکتب‌خانه مراجعه نمایید.

 

نکته ویژه: مقادیر ورودی به یک تابع می‌تواند یک مقدار پیش‌فرض را به خود بگیرند تا در صورت عدم دریافت از طرف کاربر بتوانند به کار خود ادامه دهند، قطعه کد زیر نمونه‌ای از آن را به شما نمایش می‌دهد:

 

def multiply(a,b=2):

               return a*b

print(multiply(3,5)) # 15

print(multiply(3)) # 6
"""

#در پایتون برای جایگزین کردن بخشی از یک رشته استفاده می‌کنیم

text = "Hello World"
new_text = text.replace("World", "Python")
print(new_text)
