class Human:
    def __init__(self , name , lname):
        self.name = name
        self.lname = lname
    def fullname(self):
        return  self.name + ' '+self.lname
p1 = Human('ali' , 'bigdeli')
#p2 = Human('nazanin')

#p1.name = 'ali'
#p1.lname  = 'bigdeli'

#p2.name = 'hassan'
#p2.lname = 'jabari'

print(p1.fullname())        #چون داخل کلاس تعریف شده پس برای هردو داره ایجاد میشه
##print(p2.manager)
#print(p2.name) 

"""
برنامه‌نویسی شیءگرا چیست؟
برنامه‌نویسی شیءگرا (OOP) ، همه چیز در مورد ایجاد "اشیا" است. یک شیء a گروهی از متغیرها و توابع به هم پیوسته است. این متغیرها غالباً به عنوان خصوصیات شیء یا attribute  و از توابع به عنوان رفتار یا method یاد می‌شود. این اشیا ساختار بهتر و روشنی برای برنامه فراهم می‌کنند.

 

به‌عنوان مثال، یک ماشین می‌تواند یک شیء باشد. اگر اتومبیل را به عنوان یک شیء در نظر بگیریم، ویژگی‌های آن - رنگ، مدل، قیمت، مارک تجاری و غیره آن در نظر گرفته خواهد شد. رفتار / عملکرد آن شتاب، کاهش سرعت، تغییر دنده است.

 

مثال دیگر - اگر سگ را به‌عنوان یک شیء در نظر بگیریم، ویژگی‌های آن می‌تواند باشد - رنگ، نژاد، نام، وزن و غیره و رفتار / عملکرد او راه رفتن، پارس، بازی و غیره است.

 

برنامه نویسی شیء گرا مشهور است زیرا موجودات دنیای واقعی مانند اشیا، ، پنهان کردن ، وراثت و غیره را در برنامه نویسی پیاده‌سازی می‌کند. این کار تجسم را آسان‌تر می‌کند زیرا به سناریوهای واقعی نزدیک است.

 

کلاس چیست؟
پاسخ مستقیم به این سوال این است: کلاس مجموعه‌ای از اشیا است. برخلاف ساختارهای بدوی داده‌ها، کلاس‌ها ساختارهای داده‌ای هستند که کاربر تعریف می‌کند. که در واقع کلاس‌ها کد را قابل کنترل تر می‌کنند.

ما یک کلاس را با یک کلمه کلیدی class  به دنبال یک نام و کالن (:) تعریف می‌کنیم. که خصوصیت‌ها و عملکردهایی که می‌تواند داشته باشد را در آن درج می‌کنیم.

کلاس یک طرح کلی یا blueprint برای چگونگی تعریف چیزی است. در واقع هیچ داده‌ای ندارد. کلاس سگ مشخص می‌کند که یک نام و سن برای تعریف سگ لازم است، اما این شامل نام یا سن سگ خاصی نیست.

درحالی‌که کلاس طرح اصلی است، یک نمونه شیء ای یا instanceاز یک کلاس ساخته شده و شامل داده‌های واقعی است. یک نمونه از کلاس Dog دیگر یک طرح اصلی نیست. این یک سگ واقعی با نام است.

 

__init__
خصوصیاتی که همه اشیا باید داشته باشند در روشی به نام .__ init __ () تعریف می‌شوند. هر بار که یک شیء جدید ایجاد می‌شود، .__ init __ ()  با اختصاص مقادیر خصوصیات شیء، وضعیت اولیه شیء را تنظیم می‌کند. یعنی .__ init __ () هر نمونه جدیدی از کلاس را مقدار اولیه می‌دهد.
"""