list_t = [1,2,3,4,4,5,5]
set_t  = {1,2,3,4,4,5,5}       #تو ست تکراری نداریم
set_t = set(list_t)
print(list_t , set_t)
set_t.add(6)                   #اگه 6 وجود داشته باشه که هیچی ولی اگه وجود نداشته باشه اضافه میشه
print(set_t)                   #توی ست ما نمیتونیم ایتم ها رو براساس ایندکس صدا بزنیم
                               #توی وب اسکرپینگ ست ها باعث میشن لینک های تکراری تو نتایجمون نیاد

set11 = {1,2,3,4,5}
set12 = {4,5,6,7,8}

print(set11 | set12)           #جمع دو ست
print(set11 & set12)           #اشتراک دو ست
print(set11 - set12)           #حذف اشتراکات فقس ست11 شد
print(set11 ^ set12)            #حذف اشتراکات دو ست


dict_t = {"key":"value" , "name":"Ali" , "lname":"Bigdeli"}
print(dict_t["key"])
dict_t["name"] = 'shoji'
print(dict_t)
print(dict_t.get('name'))
dict_t.update({'key' : 'Hassan' , 'lname' : 'frozan'})      #میتونیم چندتا ایتم رو اپدیت کنیم همزمان
print(dict_t)

for k,v in dict_t.items():
    print(k,v)

for k in dict_t:
    print(dict_t[k])

"""
Set چیست؟
set مجموعه موارد مرتب نشده است. هر عنصر در set باید منحصر به فرد و تغییرناپذیر باشد و set عناصر تکراری را حذف می‌کند. set ها قابل تغییر هستند که به این معنی است که می‌توانیم بعد از ایجاد آن را تغییر دهیم.

 

برخلاف مجموعه‌های دیگر در پایتون، هیچ شاخصی به عناصر مجموعه متصل نیست، به عنوان مثال، ما نمی‌توانیم مستقیماً توسط ایندکس به هیچ یک از عناصر Set دسترسی پیدا کنیم. با این حال، می‌توانیم همه آنها را با هم چاپ کنیم، یا می‌توانیم لیست عناصر را با استفاده از جستجو درون حلقه به دست آوریم.

از مجموعه عملکردهایی که در set قابل انجام است می‌توان به موارد زیر اشاره داشت:

اضافه و کم کردن به همراه بازیابی وجود المان‌ها
انجام اپراتورهای منطقی (|,&,+,-)
حذف المان‌های تکراری
و ...
 
Dictionary چیست؟
دیکشنری برای ذخیره داده‌ها در قالب یک جفت، مقدار و کلید (key:value) استفاده می‌شود. فرهنگ لغت نوع داده در پایتون است که می‌تواند آرایش داده‌های واقعی را در مقدار خاصی که برای برخی از کلیدهای خاص وجود دارد، شبیه‌سازی کند. دیکشنری یک ساختار داده قابل تغییر است.

 

نکات کلیدی دیکشنری

کلیدها باید یک عنصر واحد باشند
مقدار می‌تواند هر نوع مانند لیست، tuple ، عدد صحیح و غیره باشد.


"""