#روش اول فراخوانی ماژول
import test_modules.calculator

print(test_modules.calculator.sum_number(2, 3))

#روش دوم فراخوانی ماژول

from test_modules.calculator import sum_number

print(sum_number(3,6))

"""
ساخت یک ماژول شخصی در برنامه‌های جاری کاری است که به‌مراتب اتفاق خواهد افتاد و گاهی لازم می‌شود تا توسعه‌دهنده کدها و توابع و عملکردهای خود را به‌صورت مرتب در فایل‌هایی مجزا دسته‌بندی کند و در شرایط لازم اقدام به صدا زدن و استفاده از آن‌ها نمایید که در این میان نحوه جایگذاری و صدا کردن آن‌ها از موارد مهم در این عملکرد به شمار می‌آید.

 

ساخت یک ماژول
در حقیقت یک ماژول چیزی جز توابع و عملکردهای شما نیست که درون یک فایل مجزا قرار گرفته است. فرض کنید که توابعی دارید که در فایل با نام module قرار گرفته است و می‌خواهید فایل مربوطه را به داخل کد جاری اعمال کنید در این صورت عملکرد شما بدین صورت خواهد بود.

 

from module import function
 

که در حالت بالا با در نظر گرفتن اینکه فایل ماژول در دایرکتوری فایل فعلی قرار گرفته باشد اتفاق می‌افتد.

 

نکته: در صورتی که فایل مورد نظر درون یک پوشه قرار گرفته باشد می‌بایست نام پوشه را به همراه "." از فایل اصلی جدا کرده و صدا بزنیم. در شرایطی که اسم پوشه مورد نظر modules باشد و نام فایل اصلی calculator بدین شکل عمل خواهیم کرد.

 

from modules.calculator import function
"""
